apps/sri-core/test/fixtures/soap/recepcion-envelope.golden.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ec="http://ec.gob.sri.ws.recepcion"><soapenv:Header/><soapenv:Body><ec:validarComprobante><xml>PHNpZ25lZD48L3NpZ25lZD4=</xml></ec:validarComprobante></soapenv:Body></soapenv:Envelope>